andrewleech/micropython/ports/esp32/boards/ESP32_GENERIC_C3/mpconfigboard.h
// This configuration is for a generic ESP32C3 board with 4MiB (or more) of flash.

#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME               "ESP32C3 module"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32-C3"

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

// This board is a debug-firmware build target: enable sys.settrace() support.
#ifndef MICROPY_PY_SYS_SETTRACE
#define MICROPY_PY_SYS_SETTRACE (1)
#endif
#ifndef MICROPY_PY_SYS_SETTRACE_LOCALNAMES
#define MICROPY_PY_SYS_SETTRACE_LOCALNAMES (1)
#endif
